Revit 2027 API
BuiltInFailures.DPartFailures.NoPartMakerCreatedInEditMode Property
 Nothing will be divided.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoPartMakerCreatedInEditMode { get; }
Public Shared ReadOnly Property NoPartMakerCreatedInEditMode As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoPartMakerCreatedInEditMode {
	FailureDefinitionId^ get ();
}
static member NoPartMakerCreatedInEditMode : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace